{
  "articles": [
    {
      "id": 1,
      "title": "Ashleigh Gardner Appointed As Gujarat Giants' Captain For WPL 2025",
      "slug": "ashleigh-gardner-appointed-as-gujarat-giants-captain-for-wpl-2025",
      "excerpt": "Gujarat Giants have appointed the Australian all-rounder, Ashleigh Gardner as their captain for the 2025 edition of the Women’s Premier League (WPL) on Wednesday.",
      "content": "<div><p>After finishing at the bottom of the table in the first two editions of the Women’s Premier League, Gujarat Giants aim to change their fate in the third edition of the tournament, i.e. WPL 2025. The Gujarat-based franchise on Wednesday announced a change in leadership, with Aussie all-rounder Ashleigh Gardner named captain for the upcoming season. Gardner will take over the reins from her fellow Australian Beth Mooney, who led the team during the 2024 edition of the WPL.</p><p>Gujarat Giants will be hopeful of starting their season on a high when they take on Smriti Mandhana-led defending champions Royal Challengers Bengaluru in the opening match of WPL 2025 on Friday, February 14, at Kotambi Stadium in Vadodara.</br></br><strong>Gardner’s experience</strong><p>A crucial member of the Australian national team, Gardner made her debut in 2017 and has since played 95 T20Is, amassing over 1,400 runs and taking 78 wickets with her off-spin. She has won the prestigious Belinda Clark Award and played a key role in Australia’s gold-winning performance at the 2022 Commonwealth Games. She was also named Player of the Tournament in the 2023 T20 World Cup in South Africa.<p/><p>Having been part of Gujarat Giants since the start of the WPL, Gardner has contributed significantly with both bat and ball, scoring 324 runs and picking up 17 wickets.</p></footer></div>",
      "time": "17:16",
      "date": "2025-02-05",
      "image": "https://www.crickclare.com/images/articles/ashleigh-gardner.webp",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        4
      ],
      "tagsIds": [
        4,
        5,
        6,
        7
      ]
    },
    {
      "id": 2,
      "title": "No Indian match officials at Champions Trophy 2025",
      "slug": "no-indian-match-officials-at-champions-trophy-2025",
      "excerpt": "Javagal Srinath and Nitin Menon Mutually Agreed with the ICC that they would not undertake any officiating assignments in Pakistan",
      "content": "<div><p><a href='https://www.crickclare.com/tag/champion-trophy-2025'><strong>Champions Trophy 2025</strong></a> will have no Indian officials with two of the likeliest candidates having excused themselves from travelling to Pakistan.<p/><p>It is understood that Javagal Srinath, one of the most prolific ICC match referees, and Nitin Menon, part of the ICC's elite panel umpires, had Mutually Agreed with the ICC that they would not undertake any officiating assignments in the Pakistan leg of the tournament.</p><p>And since all matches in Dubai will feature India and require neutral officials, it automatically rules out Indian match officials. Srinath, the former India fast bowler, is currently officiating India's bilateral white-ball matches against England, but neutral officials have been the norm at all ICC tournaments.</p><p>Though Pakistan remains the official host of the Champions Trophy, a hybrid model was adopted after protracted negotiations which allowed India to play all their matches, including the semi-final and the final, should they qualify, in Dubai. The same principle will apply to Pakistan in upcoming ICC tournaments hosted by India in the current cycle, whereby all their games will be played at a neutral venue.</p><p>The 12-member umpires panel includes the ICC's Umpire of the Year Richard Illingworth, Richard Kettleborough, Michael Gough, Paul Reiffel, Chris Gaffaney and Kumar Dharmasena among others. Ahsan Raza is the sole Pakistani umpire on the list.</p><p>David Boon, Ranjan Madugalle and Andrew Pycroft will be the match referees.</p><strong>Match officials for Champions Trophy 2025</strong><br/><p><strong>Umpires: </strong><p>Kumar Dharmasena, Chris Gaffaney, Michael Gough, Adrian Holdstock, Richard Illingworth, Richard Kettleborough, Ahsan Raza, Paul Reiffel, Sharfuddoula, Rodney Tucker, Alex Wharf, Joel Wilson</p><p><strong>Match Referees: </strong><br/><p>David Boon, Ranjan Madugalle, Andrew Pycroft</p></p></footer></div>",
      "time": "11:38",
      "date": "2025-02-06",
      "image": "https://www.crickclare.com/images/articles/no-indian-match-officials.webp",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        1
      ],
      "tagsIds": [
        14,
        15,
        16,
        17,
        1,
        3
      ]
    },
    {
      "id": 3,
      "title": "IPL 2025 Schedule: Big Update on IPL 2025, Know When the Schedule Will Be Released and Who Will Play the First Match?",
      "slug": "ipl-2025-schedule",
      "excerpt": "A major update has come regarding the next season of IPL. The schedule for IPL 2025 will be released soon.",
      "content": "<div><strong>IPL 2025 Full Schedule Announcement : </strong><p>The IPL 2025 is set to begin on March 21. A major update regarding the tournament's schedule has emerged. According to a report, the full schedule for the 18th season of the Indian Premier League could be released this week. The first match of the tournament will be held between the finalist teams from the previous season. Kolkata Knight Riders won the title in the last season, defeating Sunrisers Hyderabad in the final.</p><p>Sports journalist <a href='https://www.crickclare.com/tag/vijay-tagore'><strong>Vijay Tagore</strong></a> shared an update regarding IPL 2025 on X (formerly Twitter). He posted that the schedule for IPL 2025 could be released soon. However, no official information has been received yet. The tournament was initially scheduled to start on March 14, but it has now been postponed to March 21. </p><strong>Who will play the first match of IPL 2025?</strong> <p>The tradition of starting the tournament with a match between the previous season's finalists will likely continue. The final of IPL 2024 was played between Kolkata and Hyderabad. Therefore, IPL 2025's first match could be between these two teams. This match might take place at Kolkata's Eden Gardens. </p></div>",
      "time": "17:30",
      "date": "2025-02-07",
      "image": "https://www.crickclare.com/images/articles/ipl.webp",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        6
      ],
      "tagsIds": [
        29,
        30
      ]
    },
    {
      "id": 4,
      "title": "Jasprit Bumrah has been ruled out of the 2025 ICC Champions Trophy",
      "slug": "jasprit-bumrah-ruled-out-icc-champions-trophy",
      "excerpt": "Fast bowler Jasprit Bumrah has been ruled out of the 2025 ICC Champions Trophy due to a lower back injury.",
      "content": "<div><p>Fast bowler <b>Jasprit Bumrah</b> has been ruled out of the 2025 ICC Champions Trophy due to a lower back injury. The Men’s Selection Committee has named <b>Harshit Rana</b> as Bumrah’s replacement.</p><p>Team India have also named <b>Varun Chakaravarthy</b> in the squad. The spinner will replace <b>Yashasvi Jaiswal</b> who was initially named in the provisional squad.</p><p><strong>India’s squad for ICC Champions Trophy, 2025:</strong> Rohit Sharma (Captain), Shubman Gill (Vice-captain), Virat Kohli, Shreyas Iyer, KL Rahul (WK), Rishabh Pant (WK), Hardik Pandya, Axar Patel, Washington Sundar, Kuldeep Yadav, Harshit Rana, Mohd. Shami, Arshdeep Singh, Ravindra Jadeja, Varun Chakaravarthy.</p><p><strong>Non Travelling substitutes: </strong>Yashasvi Jaiswal, Mohammed Siraj and Shivam Dube. The three players will travel to Dubai as and when required.</p></div>",
      "time": "23:20",
      "date": "2025-02-11",
      "image": "https://www.crickclare.com/images/articles/jasprit-bumrah.webp",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        5
      ],
      "tagsIds": [
        1,
        3,
        17,
        21
      ]
    },
    {
      "id": 5,
      "title": "Ghazanfar has been ruled out of the 2025 ICC Champions Trophy",
      "slug": "ghazanfar-ruled-out-icc-champions-trophy",
      "excerpt": "Ghazanfar out of Champions Trophy and IPL 2025, Afghanistan Cricket Board name Kharote as replacement",
      "content": "<div><p><b>AM Ghazanfar</b>, the 18-year-old right-arm fingerspinner who has made such a bright start to his ODI career, has been ruled out of the Champions Trophy 2025 because of a fracture in the L4 vertebra. Left-arm spinner <b>Nangeyalia Kharote</b>, who was originally in the list of reserves, has now replaced Ghazanfar in the main squad.</p><p>The <b>Afghanistan Cricket Board (ACB)</b>, which tweeted out the news on Wednesday morning, said that Ghazanfar sustained the injury during Afghanistan's tour of Zimbabwe late last year, and will be sidelined for a minimum of four months and will remain under treatment during this period. That means he will also be out of the <b>IPL2025</b> that is set to be played from March 21 to May 25. Ghazanfar had bagged his maiden IPL contract recently, with <b>Mumbai Indians</b>.</p><p><strong>Afghanistan ’s squad for ICC Champions Trophy, 2025:</strong> Hashmatullah Shahidi (Captain), Ibrahim Zadran, Ikram Alikhil (WK), Rahmanullah Gurbaz (WK), Sediqullah Atal, Rahmat Shah (Vice-captain), Azmatullah Omarzai, Gulbadin Naib, Mohammad Nabi, Rashid Khan, Fareeh Ahmad, Fazalhaq Farooqi, Nangeyalia Kharote, Naveed Zadran, Noor Ahmad</p></div>",
      "time": "09:02",
      "date": "2025-02-12",
      "image": "https://www.crickclare.com/images/articles/mohammad-ghazanfar.jpg",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        8
      ],
      "tagsIds": [
        3,
        16,
        21,
        30
      ]
    },
    {
      "id": 6,
      "title": "Sneh Rana replaces injured Shreyanka Patil at RCB in WPL2025",
      "slug": "sneh-rana-replaces-injured-shreyanka-patil-at-rcb",
      "excerpt": "Royal Challengers Bengaluru's (RCB) offspinner Shreyanka Patil has been ruled out from WPL 2025 due to injury. Spin-bowling allrounder Sneh Rana has replaced her in the squad. The details of Patil's injury are not known.",
      "content": "<div><p><a href='https://www.crickclare.com/tag/royal-challengers-bengaluru'><b>Royal Challengers Bengaluru's (RCB)</b></a> offspinner <a href='https://www.crickclare.com/tag/shreyanka-patil'><b>Shreyanka Patil</b></a> has been ruled out from <a href='https://www.crickclare.com/tag/wpl-2025'><b>WPL 2025</b></a> due to injury. Spin-bowling allrounder <a href='https://www.crickclare.com/tag/sneh-rana'><b>Sneh Rana</b></a> has replaced her in the squad. The details of Patil's injury are not known.</p><p>Sneh Rana had previously played for <a href='https://www.crickclare.com/tag/gujarat-giants'><b>Gujarat Giants (GG)</b></a> and also captained the team in the first season when <a href='https://www.crickclare.com/tag/beth-mooney'><b>Beth Mooney</b></a> was sidelined by injury after the first game. Surprisingly, Rana went unsold in the auction held last December.</p><p>Patil was one of the standout performers for RCB in their title-winning run last year and finished the tournament as the highest wicket-taker with 13 scalps in eight matches, with an economy of 7.30. Overall, she has played 15 matches for RCB and has taken 19 wickets.</p><p>RCB had lost key players like Sophie Devine (unavailable), Kate Cross, Asha Sobhana and Sophie Molineux (all injured) ahead of the season. However, they kicked off this WPL with a pulsating six-wicket win over Giants in Vadodara on Friday.</p></div>",
      "time": "22:00",
      "date": "2025-02-15",
      "image": "https://www.crickclare.com/images/articles/sneh-rana.jpg",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        4
      ],
      "tagsIds": [
        4,
        6,
        7,
        32,
        33,
        34
      ]
    },
    {
      "id": 7,
      "title": "Yashasvi Jaiswal ruled out of Ranji Trophy semi-final due to ankle pain",
      "slug": "yashasvi-jaiswal-ruled-out-of-ranji-trophy-semi-final",
      "excerpt": "Indian opener Yashasvi Jaiswal has been ruled out of the Ranji Trophy 2025 semi-finals due to ankle pain.",
      "content": "<div><p>On February 11, 2025, after failing to secure a place in the <a href='https://www.crickclare.com/tag/champion-trophy-2025'><b>Champion Trophy 2025</b></a> final team, <a href='https://www.crickclare.com/tag/yashasvi-jaiswal'><b>Yashasvi Jaiswal</b></a> had confirmed his availability for the <a href='https://www.crickclare.com/tag/ranji-trophy-2025'><b>Ranji Trophy 2025</b></a> semi-final match.</p><p>However, due to his ankle pain, Jaiswal will now miss the semi-finals and will go to the <a href='https://www.crickclare.com/tag/bcci'><b>BCCI's</b></a> Centre of Excellence for rehabilitation, where he will focus on his recovery.</p><p>Jaiswal is included in the non-traveling reserves for the Champion Trophy 2025 <a href='https://www.crickclare.com/tag/india-cricket-team'><b>Indian cricket team</b></a>.</p><p>However, Indian T20I captain <a href='https://www.crickclare.com/tag/suryakumar-yadav'><b>Suryakumar Yadav</b></a> has recovered and is fit for the Ranji Trophy semi-finals, after experiencing a slight niggle during the Mumbai vs Haryana quarter-final match in Kolkata.</p></div>",
      "time": "12:33",
      "date": "2025-02-16",
      "image": "https://www.crickclare.com/images/articles/yashsvi-jaiswal.avif",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        1
      ],
      "tagsIds": [
        36,
        1,
        3,
        17,
        21,
        35,
        37
      ]
    },
    {
      "id": 8,
      "title": "Mujeeb-ur-Rahman replaces Allah Ghazanfar in Mumbai Indians",
      "slug": "mujeeb-ur-rahman-replaces-allah-ghazanfar-in-mumbai-indians",
      "excerpt": "Mujeeb-ur-Rahman has replaced Allah Ghazanfar in the Mumbai Indians squad for the Indian Premier League (IPL) 2025 after Ghazanfar was ruled out due to a spine injury.",
      "content": "<div><p><a href='https://www.crickclare.com/tag/mumbai-indians'><strong>Mumbai Indians</strong></a> have signed <a href='https://www.crickclare.com/tag/mujeeb-ur-rahman'><strong>Mujeeb Ur Rahman</strong></a>, the Afghanistan spinner, as a replacement for <a href='https://www.crickclare.com/tag/am-ghazanfar'><strong>AM Ghazanfar</strong></a>, who has been ruled out of the <a href='https://www.crickclare.com/tag/ipl-2025'><strong>Indian Premier League 2025</strong></a> due to a spine injury.</p> <p>Ghazanfar was also ruled out of the <a href='https://www.crickclare.com/tag/champion-trophy-2025'><strong>Champions Trophy 2025</strong></a> due to the spine injury he sustained during the Zimbabwe tour.</p> <p>Mujeeb, who is not part of Afghanistan's Champions Trophy 2025 squad, recently featured in the <a href='https://www.crickclare.com/tag/sa20-2025'><strong>SA20 2025</strong></a> and also played in the three T20Is against Zimbabwe. The 23-year-old was not considered for selection by Afghanistan in other formats following medical advice to focus on T20 cricket, ensuring a full recovery from a right phalanx sprain before returning to ODIs.</p> <p>Mujeeb Ur Rahman, a right-arm off-spinner, has played 19 IPL matches, taking 19 wickets. He joins Mumbai Indians for INR 2 Crore.</p></div>",
      "time": "14:00",
      "date": "2025-02-16",
      "image": "https://www.crickclare.com/images/articles/mujeeb-ur-rahman.avif",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        8
      ],
      "tagsIds": [
        3,
        30,
        38,
        39,
        40,
        41
      ]
    },
    {
      "id": 9,
      "title": "Morne Morkel leaves India's camp in Dubai to return home following his father's death",
      "slug": "morne-morkel-leaves-indias-camp-in-dubai",
      "excerpt": "According to a report, Morne Morkel has returned home due to a personal emergency, and it is not clear at this stage whether he will return to join the side.",
      "content": "<div><p> The Indian team arrived in Dubai on <strong>February 15, 2025</strong> to participate in the <a href='https://www.crickclare.com/tag/champion-trophy-2025'><strong>Champions Trophy 2025</strong></a>. The team conducted their first practice session on <strong>February 16, 2025</strong> at <em>1 PM (Dubai time)</em>. </p> <p> On <strong>February 18, 2025</strong>, at <em>5 PM (Dubai time)</em>, the team arrived at the <strong>ICC Cricket Academy</strong> for another practice session. </p> <p> However, bowling coach<a href='https://www.crickclare.com/tag/morne-morkel'><strong> Morne Morkel</strong></a> was absent due to the unfortunate passing of his father. According to senior sports journalist <strong>Abhishek Tripathi</strong>, Morne Morkel has left the Indian camp and returned to South Africa. </p> <p> There is currently <em>no official information</em> on when he will rejoin the team. </p></div>",
      "time": "22:32",
      "date": "2025-02-17",
      "image": "https://www.crickclare.com/images/articles/morne-morkel.avif",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        5
      ],
      "tagsIds": [
        1,
        3,
        16,
        42
      ]
    }
  ]
}