{
  "articles": [
    {
      "id": 1,
      "title": "Rohit Sharma To Quit After Champions Trophy?",
      "slug": "retirement-pressure-on-rohit-sharma-as-bcci-sends-future-after-champions-trophy-message-report",
      "excerpt": "India captain Rohit Sharma might not have another option but to take a call on his future after the conclusion of the ICC Champions Trophy.",
      "content": "<div><p><strong>India's ODI and Test captain Rohit Sharma</strong> called it quits from the shortest format after India won the T20 World Cup last year. A similar action could be unrolled after the upcoming ICC Champions Trophy in Pakistan and Dubai. Rohit hasn't had form going his way for a long time, and he reportedly came close to hanging his boots in the Test format before reversing the decision. However, the Board of Control for Cricket in India (BCCI) is said to have told the India skipper to clarify his future plans after the Champions Trophy concludes. With the board keen on charting out the path for the 2027 ODI World Cup, clarity on Rohit's future is a must.</p><p>The selectors and people on the board had this discussion with Rohit around the time of the last selection meeting. He has been told that he needs to decide how he wants to plan his future after the Champions Trophy. The team management has certain plans going into the next World Test Championship (WTC) cycle and the ODI World Cup. They want to ensure everyone is on the same page for a smoother transition.</footer></div>",
      "time": "14:30",
      "date": "2025-02-05",
      "image": "https://crickclare.com/images/articles/rohit.webp",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        1
      ],
      "tagsIds": [
        1,
        2,
        3
      ]
    },
    {
      "id": 2,
      "title": "Ashleigh Gardner Appointed As Gujarat Giants' Captain For WPL 2025",
      "slug": "ashleigh-gardner-appointed-as-gujarat-giants-captain-for-wpl-2025",
      "excerpt": "Gujarat Giants have appointed the Australian all-rounder, Ashleigh Gardner as their captain for the 2025 edition of the Women’s Premier League (WPL) on Wednesday.",
      "content": "<div><p>After finishing at the bottom of the table in the first two editions of the Women’s Premier League, Gujarat Giants aim to change their fate in the third edition of the tournament, i.e. WPL 2025. The Gujarat-based franchise on Wednesday announced a change in leadership, with Aussie all-rounder Ashleigh Gardner named captain for the upcoming season. Gardner will take over the reins from her fellow Australian Beth Mooney, who led the team during the 2024 edition of the WPL.</p><p>Gujarat Giants will be hopeful of starting their season on a high when they take on Smriti Mandhana-led defending champions Royal Challengers Bengaluru in the opening match of WPL 2025 on Friday, February 14, at Kotambi Stadium in Vadodara.</br></br><strong>Gardner’s experience</strong><p>A crucial member of the Australian national team, Gardner made her debut in 2017 and has since played 95 T20Is, amassing over 1,400 runs and taking 78 wickets with her off-spin. She has won the prestigious Belinda Clark Award and played a key role in Australia’s gold-winning performance at the 2022 Commonwealth Games. She was also named Player of the Tournament in the 2023 T20 World Cup in South Africa.<p/><p>Having been part of Gujarat Giants since the start of the WPL, Gardner has contributed significantly with both bat and ball, scoring 324 runs and picking up 17 wickets.</p></footer></div>",
      "time": "17:16",
      "date": "2025-02-05",
      "image": "https://crickclare.com/images/articles/ashleigh-gardner.webp",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        4
      ],
      "tagsIds": [
        4,
        5,
        6,
        7
      ]
    },
    {
      "id": 3,
      "title": "Sun Group secures 100% stake in Northern Superchargers",
      "slug": "sun-group-secures-stake-in-northern-superchargers",
      "excerpt": "Third team with IPL involvement, as Sunrisers Hyderabad owners make highest bid for Leeds franchise",
      "content": "<div><p>A third IPL franchise owner has emerged victorious in the ongoing Hundred sale with the Sun Group, owners of Sunrisers Hyderabad, making the highest bid to buy a stake in Northern Superchargers, whose host county is Yorkshire.</p><p>Crick Clare understands that the Sun Group have agreed to buy 100% of the franchise: both the ECB's 49% stake, and Yorkshire's 51% share. The Superchargers are the first team to be sold outright, with host venues retaining a share in the first five franchises sold.<p>The Sun Group's valuation of Superchargers was £100 million, with two other parties understood to have been involved in the auction. Both Yorkshire and Sun Group have to finalise the agreement within eight weeks of the end of the Hundred sale.<p/><p>Yorkshire will keep 80% of the revenue from the sale of their 51% stake, which will provide the club with an injection of around £40m. Colin Graves, Yorkshire's chairman, predicted last year that the club would soon be <strong>fighting for its survival</strong> due to debts of more than £20m, of which around £15m is owed to his family trust (which is managed by independent trustees).</p><p>The Superchargers will be the third T20 franchise team in the Sun Group's portfolio. They acquired Sunrisers Hyderabad in 2012, who went on to win the IPL in 2016 and finished as runners-up last year. In 2023, they added Sunrisers Eastern Cape, who have won the SA20 title in its first two editions.</p><p>The Sun Group is owned by Kalanithi Maran, an Indian media baron, who successfully bid for the IPL franchise after the BCCI terminated the ownership contract of the previous Hyderabad-based team, Deccan Chargers, in 2012.</p><p>The Sun Group joins owners of two other IPL franchises - RPSG Group (owners of Lucknow Super Giants) and Reliance Industries Limited (owners of Mumbai Indians) - who made the highest bids to buy stakes in Manchester Originals and Oval Invincibles respectively.</p><p>There could be at least one other IPL owner, the GMR Group, the co-owners of Delhi Capitals, who are also widely expected to buy a stake in Southern Brave after securing a deal to buy host county Hampshire last year.</p></footer></div>",
      "time": "10:09",
      "date": "2025-02-06",
      "image": "https://crickclare.com/images/articles/The-Hundred-2025.jpg",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        3
      ],
      "tagsIds": [
        8,
        9,
        10,
        11,
        12,
        13
      ]
    },
    {
      "id": 4,
      "title": "No Indian match officials at Champions Trophy 2025",
      "slug": "no-indian-match-officials-at-champions-trophy-2025",
      "excerpt": "Javagal Srinath and Nitin Menon Mutually Agreed with the ICC that they would not undertake any officiating assignments in Pakistan",
      "content": "<div><p><a href='https://crickclare.com/tag/champion-trophy-2025'><strong>Champions Trophy 2025</strong></a> will have no Indian officials with two of the likeliest candidates having excused themselves from travelling to Pakistan.<p/><p>It is understood that Javagal Srinath, one of the most prolific ICC match referees, and Nitin Menon, part of the ICC's elite panel umpires, had Mutually Agreed with the ICC that they would not undertake any officiating assignments in the Pakistan leg of the tournament.</p><p>And since all matches in Dubai will feature India and require neutral officials, it automatically rules out Indian match officials. Srinath, the former India fast bowler, is currently officiating India's bilateral white-ball matches against England, but neutral officials have been the norm at all ICC tournaments.</p><p>Though Pakistan remains the official host of the Champions Trophy, a hybrid model was adopted after protracted negotiations which allowed India to play all their matches, including the semi-final and the final, should they qualify, in Dubai. The same principle will apply to Pakistan in upcoming ICC tournaments hosted by India in the current cycle, whereby all their games will be played at a neutral venue.</p><p>The 12-member umpires panel includes the ICC's Umpire of the Year Richard Illingworth, Richard Kettleborough, Michael Gough, Paul Reiffel, Chris Gaffaney and Kumar Dharmasena among others. Ahsan Raza is the sole Pakistani umpire on the list.</p><p>David Boon, Ranjan Madugalle and Andrew Pycroft will be the match referees.</p><strong>Match officials for Champions Trophy 2025</strong><br/><p><strong>Umpires: </strong><p>Kumar Dharmasena, Chris Gaffaney, Michael Gough, Adrian Holdstock, Richard Illingworth, Richard Kettleborough, Ahsan Raza, Paul Reiffel, Sharfuddoula, Rodney Tucker, Alex Wharf, Joel Wilson</p><p><strong>Match Referees: </strong><br/><p>David Boon, Ranjan Madugalle, Andrew Pycroft</p></p></footer></div>",
      "time": "11:38",
      "date": "2025-02-06",
      "image": "https://crickclare.com/images/articles/no-indian-match-officials.webp",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        1
      ],
      "tagsIds": [
        14,
        15,
        16,
        17,
        1,
        3
      ]
    },
    {
      "id": 5,
      "title": "Marcus Stoinis Announces ODI Retirement",
      "slug": "marcus-stoinis-retires-from-odi-cricket-with-immediate-effect",
      "excerpt": "Australia all-rounder Marcus Stoinis has unexpectedly announced his retirement from ODIs on February 6 (Thursday).",
      "content": "<div><p>Australia all-rounder <a href='https://crickclare.com/tag/marcus-stoinis'><strong>Marcus Stoinis</strong></a> has unexpectedly announced his retirement from ODIs on February 6 (Thursday). Stoinis, who made his debut in 2015, played 71 ODI matches and has decided to shift his focus to T20 cricket. Having been initially named in the squad for the <a href='https://crickclare.com/tag/champion-trophy-2025'><strong>ICC Champions Trophy 2025</strong></a>, his replacement will now be required.<p/><p>Playing ODI cricket for Australia has been an incredible journey, and I’m grateful for every moment I’ve had in the green and gold. Representing my country at the highest level is something I’ll always cherish. This wasn’t an easy decision, but I believe it’s the right time for me to step away from ODIs and fully focus on the next chapter of my career. I’ve got a fantastic relationship with Ron (Australia men's team coach Andrew McDonald) and I’ve hugely appreciated his support. I’ll be cheering the boys on in Pakistan,' Stoinis said on February 6 (Thursday) as quoted by <a href='https://crickclare.com/tag/cricket-australia'><strong>cricket.com.au.</strong></a></p></footer></div>",
      "time": "12:17",
      "date": "2025-02-06",
      "image": "https://crickclare.com/images/articles/stoinis.avif",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        2
      ],
      "tagsIds": [
        18,
        19,
        20,
        21,
        3
      ]
    },
    {
      "id": 6,
      "title": "Cummins and Hazlewood ruled out of Champions Trophy",
      "slug": "pat-cummins-and-josh-hazlewood-ruled-out-of-champions-trophy",
      "excerpt": "Abbott, Johnson, Dwarshuis, Sangha, Connolly and Fraser-McGurk, who have been added to the ODI squad in Sri Lanka, are in the mix for the final Champions Trophy squad",
      "content": "<div> <p> <a href='https://crickclare.com/tag/pat-cummins'><strong>Pat Cummins</strong></a> and <a href='https://crickclare.com/tag/josh-hazlewood'><strong>Josh Hazlewood</strong></a> have both been officially ruled out of the Champions Trophy. The two of them are managing some ongoing injuries and haven't recovered in time for the Champions Trophy, selection chair George Bailey said on Thursday. </p> <p> Australia have until February 12 to finalise their Champions Trophy squad, and they will have to make at least four changes to the initial 15-man squad they had named on January 13. Apart from Cummins and Hazlewood, they are also without Mitchell Marsh, who is grappling with a back injury and was ruled out of the tournament on January 31, and Marcus Stoinis, who announced on Thursday that he would be retiring from ODI cricket, removing himself from the Champions Trophy squad as a result after being selected in the original 15. </p> <p> February 12 is also the day when Australia play the first of two ODIs against Sri Lanka in Colombo. They have added three quicks, Sean Abbott, Spencer Johnson, and Ben Dwarshuis for those two games as well as legspinner Tanveer Sangha, spin-bowling allrounder Cooper Connolly, and batter Jake Fraser-McGurk. </p> <p> It's possible that two of the three quick bowlers could get into the Champions Trophy squad, while Fraser-McGurk appears to be the like-for-like replacement for Marsh, given he has not been bowling much recently in ODI cricket and was locked in to bat at No. 3. Connolly could be the replacement for Stoinis, but there is now only one seam-bowling allrounder, Aaron Hardie, left in the current squad. Test allrounder Beau Webster has not been included among the additions to the Sri Lanka ODI squad. </p> <p> While disappointing, it does present a great opportunity for other players to perform for Australia in a world event, Bailey said. </p> <p> Cricket Australia said Cummins and Hazlewood would begin an 'extended period of rehabilitation'. They are missing the ongoing Test series in Sri Lanka too. Both have IPL contracts, with Cummins set to lead Sunrisers Hyderabad (SRH) again, while Hazlewood is returning to Royal Challengers Bengaluru (RCB). Whether they can play any part in the IPL ahead of the World Test Championship final against South Africa at Lord's in June remains to be seen. </p> <p> Australia are likely to pick between Steven Smith and Travis Head to lead Australia in the two Sri Lanka ODIs and then the Champions Trophy. </p></div>",
      "time": "09:31",
      "date": "2025-02-07",
      "image": "https://crickclare.com/images/articles/cummins-haxlewood.webp",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        2
      ],
      "tagsIds": [
        22,
        19,
        23,
        3
      ]
    },
    {
      "id": 7,
      "title": "BCCI calls SGM on March 1 to appoint new joint secretary",
      "slug": "bcci-special-general-meeting-march-1-date-joint-secretary-appointment-agenda-notice",
      "excerpt": "This will be the second SGM in less than two months, following the previous one held on January 12, where Saikia was elected as the new secretary.",
      "content": "<div> <p>The Board of Control for Cricket in India (BCC) has convened a Special General Meeting (SGM) in Mumbai on March 1 to appoint a new joint secretary after the position was left vacant following the elevation of Devjit Saikia to the post of the board’s secretary. </p> <p>Assam Cricket Association’s (ACA) Saikia had succeeded Jay Shah in the secretary’s position last month, after the latter took over as the chairman of the International Cricket Council (ICC) on December 1. </p> <p>The BCCI sent out the SGM notice to the State associations with a single-item agenda. </p> <p> “Notice is hereby given for a Special General Meeting of the BCCI which will be held at 12:00PM IST on March 1, 2025, at BCCI headquarters at Mumbai, to transact the business of Election and Induction of the Joint Secretary of BCCI,” the apex board said in a statement. </p> <p> The names of former Cricket Association of Bengal (CAB) president Avishek Dalmiya (East Zone), Delhi & District Cricket Association (DDCA) chief Rohan Jaitley (North Zone) and Mumbai Cricket Association’s (MCA) Sanjay Naik (West Zone) are doing the rounds for the post. </p> <p> Like it happened in the case of BCCI secretary and treasurer, there won’t be any election to pick the board’s new joint secretary. </p><p> As a rule, a 21-day notice is required to call an SGM and the BCCI has followed the requirement. </p><p> This will be the second SGM in less than two months, following the previous one held on January 12, where Saikia was elected as the new secretary and Prabhtej Singh Bhatia as the new treasurer. Both were elected unopposed. </p><p> The joint secretary’s job is to oversee various administrative tasks and work closely with other board members to ensure its operations are run efficiently. </p></div>",
      "time": "11:33",
      "date": "2025-02-07",
      "image": "https://crickclare.com/images/articles/bcci.jpg",
      "author": {
        "name": "Shreyansh Vaghasiya",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        5
      ],
      "tagsIds": [
        1,
        17,
        24,
        25,
        26,
        27,
        28
      ]
    },
    {
      "id": 8,
      "title": "IPL 2025 Schedule: Big Update on IPL 2025, Know When the Schedule Will Be Released and Who Will Play the First Match?",
      "slug": "ipl-2025-schedule",
      "excerpt": "A major update has come regarding the next season of IPL. The schedule for IPL 2025 will be released soon.",
      "content": "<div><strong>IPL 2025 Full Schedule Announcement : </strong><p>The IPL 2025 is set to begin on March 21. A major update regarding the tournament's schedule has emerged. According to a report, the full schedule for the 18th season of the Indian Premier League could be released this week. The first match of the tournament will be held between the finalist teams from the previous season. Kolkata Knight Riders won the title in the last season, defeating Sunrisers Hyderabad in the final.</p><p>Sports journalist <a href='https://crickclare.com/tag/vijay-tagore'><strong>Vijay Tagore</strong></a> shared an update regarding IPL 2025 on X (formerly Twitter). He posted that the schedule for IPL 2025 could be released soon. However, no official information has been received yet. The tournament was initially scheduled to start on March 14, but it has now been postponed to March 21. </p><strong>Who will play the first match of IPL 2025?</strong> <p>The tradition of starting the tournament with a match between the previous season's finalists will likely continue. The final of IPL 2024 was played between Kolkata and Hyderabad. Therefore, IPL 2025's first match could be between these two teams. This match might take place at Kolkata's Eden Gardens. </p></div>",
      "time": "17:30",
      "date": "2025-02-07",
      "image": "https://crickclare.com/images/articles/ipl.webp",
      "author": {
        "name": "Shreyansh Vaghasiya",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        6
      ],
      "tagsIds": [
        29,
        30
      ]
    },
    {
      "id": 9,
      "title": "Jacob Bethell to miss Champions Trophy due to hamstring injury",
      "slug": "jacob-bethell-ruled-out",
      "excerpt": "England all-rounder Jacob Bethell has been ruled out of the upcoming 2025 ICC Champions Trophy with a left hamstring injury.",
      "content": "<div><p><a href='https://crickclare.com/tag/england-cricket-team'><storng>England</storng></a> all-rounder Jacob Bethell has been ruled out of the upcoming 2025 ICC Champions Trophy with a left hamstring injury.</p><p>The setback came during England's tour of India, making him miss the second ODI in Cuttack.</p><p>Team captain Jos Buttler expressed his disappointment over Bethell's situation, saying 'I'm pretty sure he's been ruled out of the Champions Trophy, to be honest.'</p><p>He made this statement after England's loss against hosts India in the second ODI in Cuttack on Sunday.</p><strong>Tom Banton to join England squad ahead of third ODI vs India</strong><p>Tom Banton is expected to join the side on Monday and will only be available to play the third ODI in Ahmedabad</p></div>",
      "time": "11:04",
      "date": "2025-02-10",
      "image": "https://crickclare.com/images/articles/tom-banton.jpg",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        7
      ],
      "tagsIds": [
        3,
        10,
        21,
        16
      ]
    },
    {
      "id": 10,
      "title": "UP Warriorz Appoint Deepti Sharma as Captain After Alyssa Healy Withdraws Due to Foot Injury",
      "slug": "deepti-sharma-appoint-as-captain-up-warriorz",
      "excerpt": "UP Warriorz have named Deepti Sharma as their captain for WPL 2025, following Alyssa Healy's withdrawal due to a foot injury.",
      "content": "<div><p>Indian allrounder Deepti Sharma will be leading <a href='https://crickclare.com/tag/up-warriorz'><storng>UP Warriorz</storng></a> in WPL 2025 in the absence of regular skipper Alyssa Healy. The Australian, who just recently played the one-off Ashes Test purely as a batter due to a stress reaction, has been advised to rest for the next few weeks and as a result, will skip this year's edition.</p><p>Deepti has been a part of the UP Warriorz right from the inaugural edition and is their second highest wicket-taker with 19 wickets from 17 games. With the bat, she has scored 385 runs with 295 of those coming last year when she was named the MVP. During her incredible run last year, Deepti had also become the first Indian to pick up a hat-trick in the WPL.</p><p>The 27-year-old, who is India's leading wicket-taker in T20Is, hails from Uttar Pradesh and will become the first player to lead her home franchise in their home stadium with the tournament expanding to more venues this season. UP Warriorz kickstart their campaign on February against Gujarat Giants and are scheduled to play three games at home next month.</p><p>❝I am delighted and honoured to be named captain of the UP Warriorz, which is a team from my home state,❞ Deepti said on her appointment. ❝The UP Warriorz has a fantastic squad, and we are confident that we will entertain our fans with the Warriorz brand of cricket, at the WPL this season as well. We can't wait to play in Lucknow in front of our home fans, and hope to inspire the next generation of women athletes.❞</p></div>",
      "time": "15:00",
      "date": "2025-02-09",
      "image": "https://crickclare.com/images/articles/deepti-sharma-alyssa.webp",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        4
      ],
      "tagsIds": [
        4,
        19,
        31,
        1
      ]
    },
    {
      "id": 11,
      "title": "Jasprit Bumrah has been ruled out of the 2025 ICC Champions Trophy",
      "slug": "jasprit-bumrah-ruled-out-icc-champions-trophy",
      "excerpt": "Fast bowler Jasprit Bumrah has been ruled out of the 2025 ICC Champions Trophy due to a lower back injury.",
      "content": "<div><p>Fast bowler <b>Jasprit Bumrah</b> has been ruled out of the 2025 ICC Champions Trophy due to a lower back injury. The Men’s Selection Committee has named <b>Harshit Rana</b> as Bumrah’s replacement.</p><p>Team India have also named <b>Varun Chakaravarthy</b> in the squad. The spinner will replace <b>Yashasvi Jaiswal</b> who was initially named in the provisional squad.</p><p><strong>India’s squad for ICC Champions Trophy, 2025:</strong> Rohit Sharma (Captain), Shubman Gill (Vice-captain), Virat Kohli, Shreyas Iyer, KL Rahul (WK), Rishabh Pant (WK), Hardik Pandya, Axar Patel, Washington Sundar, Kuldeep Yadav, Harshit Rana, Mohd. Shami, Arshdeep Singh, Ravindra Jadeja, Varun Chakaravarthy.</p><p><strong>Non Travelling substitutes: </strong>Yashasvi Jaiswal, Mohammed Siraj and Shivam Dube. The three players will travel to Dubai as and when required.</p></div>",
      "time": "23:20",
      "date": "2025-02-11",
      "image": "https://crickclare.com/images/articles/jasprit-bumrah.webp",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        5
      ],
      "tagsIds": [
        1,
        3,
        17,
        21
      ]
    },
    {
      "id": 12,
      "title": "Ghazanfar has been ruled out of the 2025 ICC Champions Trophy",
      "slug": "ghazanfar-ruled-out-icc-champions-trophy",
      "excerpt": "Ghazanfar out of Champions Trophy and IPL 2025, Afghanistan Cricket Board name Kharote as replacement",
      "content": "<div><p><b>AM Ghazanfar</b>, the 18-year-old right-arm fingerspinner who has made such a bright start to his ODI career, has been ruled out of the Champions Trophy 2025 because of a fracture in the L4 vertebra. Left-arm spinner <b>Nangeyalia Kharote</b>, who was originally in the list of reserves, has now replaced Ghazanfar in the main squad.</p><p>The <b>Afghanistan Cricket Board (ACB)</b>, which tweeted out the news on Wednesday morning, said that Ghazanfar sustained the injury during Afghanistan's tour of Zimbabwe late last year, and will be sidelined for a minimum of four months and will remain under treatment during this period. That means he will also be out of the <b>IPL2025</b> that is set to be played from March 21 to May 25. Ghazanfar had bagged his maiden IPL contract recently, with <b>Mumbai Indians</b>.</p><p><strong>Afghanistan ’s squad for ICC Champions Trophy, 2025:</strong> Hashmatullah Shahidi (Captain), Ibrahim Zadran, Ikram Alikhil (WK), Rahmanullah Gurbaz (WK), Sediqullah Atal, Rahmat Shah (Vice-captain), Azmatullah Omarzai, Gulbadin Naib, Mohammad Nabi, Rashid Khan, Fareeh Ahmad, Fazalhaq Farooqi, Nangeyalia Kharote, Naveed Zadran, Noor Ahmad</p></div>",
      "time": "09:02",
      "date": "2025-02-12",
      "image": "https://crickclare.com/images/articles/mohammad-ghazanfar.jpg",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        8
      ],
      "tagsIds": [
        3,
        16,
        21,
        30
      ]
    },
    {
      "id": 13,
      "title": "Samson undergoes finger surgery, expected to be fit in time for IPL 2025",
      "slug": "samson-undergoes-finger-surgery",
      "excerpt": "Samson undergoes finger surgery, expected to be fit in time for IPL 2025, He is expected to take a month to recover after the surgery",
      "content": "<div><p>India wicketkeeper-batter Sanju Samson has undergone a surgery on his finger, but is expected to be fit in time for the IPL, where he will lead Rajasthan Royals (RR). It is understood that Samson will take around a month to recover after his surgery took place on Tuesday. That gives him enough time for be ready for the IPL, which will start in the March 21-22-23 weekend.</p><p>Samson picked up the injury during the fifth T20I against England earlier this month when he was hit by a Jofra Archer delivery early in the game. Samson scored 16 off seven and was later subbed out because of the injury and Dhruv Jurel kept wickets in his place; he went on to take three catches in India's massive 150-run win.</p><p>The injury forced Samson miss Kerala's quarter-final in the Ranji Trophy, against Jammu & Kashmir in Pune from February 8.</p><p>Samson didn't have a great T20I series against England, scoring just 51 runs in five games to average 10.20, while striking at 118.60.</p><p>He last played an ODI in December 2023 - when he scored a century against South Africa - and after India played just three ODIs in 2024, he was left out of Kerala's one-day squad in the Vijay Hazare Trophy after he failed to show up for their preparatory camp in the lead-up to the tournament.</p><p>Samson's next assignment will be leading RR in IPL 2025. RR made the playoffs under his captaincy last season but were beaten by Sunrisers Hyderabad (SRH) in the second Qualifier.</p></div>",
      "time": "11:00",
      "date": "2025-02-12",
      "image": "https://crickclare.com/images/articles/sanju-samson.avif",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        6
      ],
      "tagsIds": [
        30,
        17
      ]
    },
    {
      "id": 14,
      "title": "Rajat Patidar to be appointed as the new skipper of RCB",
      "slug": "rajat-patidar-rcb-new-skipper",
      "excerpt": "After suggesting that formar RCB skipper Virat Kohli will not be taking charge as the skipper in IPL 2025, reports suggested that Madhya Pradesh batter Rajat Patidar might appoint as the new skipper of RCB in the coming IPL season.",
      "content": "<div><p>After suggesting that formar RCB skipper <b>Virat Kohli</b> will not be taking charge as the skipper in IPL 2025, reports suggested that Madhya Pradesh batter <b>Rajat Patidar</b> might appoint as the new skipper of RCB in the coming IPL season.</p><p>According to The Sports journalist <b>Rohit Juglan</b> Rajat Patidar might appoint as the new skipper of RCB.</p><p>However, the report added that the team was forced into a rethink in the light of some ‘strong indications’ coming in from Kohli and discussions with ‘senior India players in the RCB camp’, thereby pushing Patidar to a serious second choice. Another candidate, <b>Krunal Pandya</b>, has also been talked about in this context. It also stated that mentor <b>Dinesh Karthik</b> had played a big role in this captaincy search.</p><p>RCB is now poised to announce its new captain on Thursday, February 13, having sent media invites for a special event to take place at 11:30 a.m in bengaluru. Present at the moment would be several big-name staff members, including director Mo Bobat, head coach Andy Flower, and Karthik.</p><p>Rajat Patidar and Krunal Pandya lead Madhya Pradesh and Baroda, respectively, in domestic cricket. Patidar was retained for 11 crores by RCB.</p></div>",
      "time": "23:20",
      "date": "2025-02-13",
      "image": "https://crickclare.com/images/articles/rajat-ratidar.webp",
      "author": {
        "name": "Crick Clare",
        "bio": "Crick Clare is your 360 degree view on Sports news, opinion and behind the scenes in Indian sporting scenario. Crick Clare brings you all the Indian and world cricket action. Crick Clare is your one stop destination for Sports."
      },
      "categoryIds": [
        6
      ],
      "tagsIds": [
        30,
        32
      ]
    }
  ]
}