{
    "categories": [
        {
            "id": 1,
            "name": "Cricket",
            "slug": "cricket",
            "description": "Cricket is a popular team sport played with a bat and ball, primarily in countries like India, Australia, England, and South Africa. The game is played between two teams, typically consisting of 11 players each. The aim is to score more runs than the opposing team.",
            "longDescription": "Cricket is a bat-and-ball game played between two teams of eleven players on a field at the centre of which is a 22-yard (20-metre) pitch with a wicket at each end, each comprising two bails balanced on three stumps. The game proceeds when a player on the fielding team, called the bowler, 'bowls' (propels) the ball from one end of the pitch towards the wicket at the other end, with an 'over' consisting of six such deliveries. The batting side has one player at each end of the pitch, with the player at the opposite end of the pitch from the bowler aiming to strike the ball with a bat. The batting side scores runs either when the ball reaches the boundary of the field, or when the two batters swap ends of the pitch, which results in one run. The fielding side's aim is to prevent run-scoring and dismiss each batter (so they are 'out', and are said to have 'lost their wicket'). Means of dismissal include being bowled, when the bowled ball hits the stumps and dislodges the bails, and by the fielding side either catching a hit ball before it touches the ground, or hitting a wicket with the ball before a batter can cross the crease line in front of the wicket to complete a run. When ten batters have been dismissed, the innings ends and the teams swap roles. The game is adjudicated by two umpires, aided by a third umpire and match referee in international matches.",
            "parentId": null,
            "image": "https://www.crickclare.com/images/cricket.jpg",
            "keywords": [
                "cricket",
                "bat and ball",
                "team sport",
                "international cricket"
            ]
        },
        {
            "id": 2,
            "name": "Australian Cricket",
            "slug": "australian-cricket",
            "description": "The Australia national cricket team represents Australia in men's international cricket. It is the most successful team in Test cricket history, winning and participating in the first-ever Test match in 1877.",
            "longDescription": "The Australia national cricket team represents Australia in men's international cricket. Along with England, it is the joint oldest team in Test cricket history, playing and winning the first ever Test match in 1877. The team also plays One-Day International (ODI) and Twenty20 International (T20I) cricket, participating in both the first ODI, against England in the 1970–71 season and the first T20I, against New Zealand in the 2004–05 season, winning both games. The team draws its players from teams playing in the Australian domestic competitions – the Sheffield Shield, the Australian domestic limited-overs cricket tournament and the Big Bash League. Australia are the current ICC World Test Championship and ICC Cricket World Cup champions. They are regarded as the most successful national team in the history of cricket.",
            "parentId": 1,
            "image": "https://www.crickclare.com/images/australian-cricket.jpg",
            "keywords": [
                "Australian cricket",
                "national team",
                "Test cricket",
                "ODI",
                "T20I"
            ]
        },
        {
            "id": 3,
            "name": "The Hundred",
            "slug": "the-hundred",
            "description": "The Hundred is a professional Cricket league in the United Kingdom and is the only cricket league in the world played in a 100-ball format. It is organised by the England and Wales Cricket Board (ECB) every year in July and August.",
            "longDescription": "The Hundred is a professional 100-ball cricket tournament involving eight men's and women's teams located in major cities across England and Wales. The tournament is run by the England and Wales Cricket Board (ECB) and took place for the first time in July and August 2021. The format aims to attract younger audiences to the game. Matches last about two and a half hours. The tournament includes a men's and women's competition, consisting of 68 matches in total, with both competitions running concurrently. The competition has been controversial, with many fans and players critical of the ECB's decision to create a new format of cricket, rather than to promote existing forms of the game.",
            "parentId": 1,
            "image": "https://www.crickclare.com/images/the-hundred.jpg",
            "keywords": [
                "The Hundred",
                "100-ball cricket",
                "ECB",
                "UK cricket league"
            ]
        },
        {
            "id": 4,
            "name": "Women's Premier League",
            "slug": "womens-premier-league",
            "description": "The Women's Premier League (WPL) is a women's Twenty20 cricket franchise league in India. It is owned and operated by the Board of Control for Cricket in India (BCCI).",
            "longDescription": "The Women's Premier League (WPL) is a women's Twenty20 cricket league in India. The league is owned and operated by the Board of Control for Cricket in India (BCCI) and consists of five teams. It is the women's edition of the Indian Premier League. The inaugural tournament took place in March 2023 with Mumbai Indians becoming the first-ever champions. The WPL has been praised for its potential to revolutionize women's cricket in India and globally, providing a platform for female cricketers to showcase their talents and earn substantial incomes. The league has attracted top international talent alongside India's best players, contributing to the growth and popularity of women's cricket.",
            "parentId": 1,
            "image": "https://www.crickclare.com/images/womens-premier-league.jpg",
            "keywords": [
                "Women's Premier League",
                "WPL",
                "women's cricket",
                "T20 league",
                "BCCI"
            ]
        },
        {
            "id": 5,
            "name": "BCCI",
            "slug": "bcci",
            "description": "The Board of Control for Cricket in India (BCCI) is the governing body for cricket in India. Established in 1928, it is one of the most influential and financially powerful cricket boards globally.",
            "longDescription": "The Board of Control for Cricket in India (BCCI) is the national governing body for cricket in India. Founded in December 1928 as a society, registered under the Tamil Nadu Societies Registration Act, it is a consortium of state cricket associations and the state associations select their representatives who in turn elect the BCCI officials. The BCCI logo is derived from the emblem of the Order of the Star of India, the British Raj emblem during the colonial period. The BCCI is the richest governing body of cricket in the world. It is responsible for the conduct of many cricket tournaments in India, including the Indian Premier League, the Ranji Trophy, the Duleep Trophy, the Vijay Hazare Trophy, the Deodhar Trophy, and many others. The BCCI has been instrumental in shaping the modern era of cricket, particularly through its influence on the International Cricket Council (ICC) and its role in the development of Twenty20 cricket.",
            "parentId": 1,
            "image": "https://www.crickclare.com/images/bcci.jpg",
            "keywords": [
                "BCCI",
                "cricket administration",
                "Indian cricket",
                "cricket governance"
            ]
        },
        {
            "id": 6,
            "name": "IPL",
            "slug": "ipl",
            "description": "The Indian Premier League, also known as IPL and Tata IPL for sponsorship reasons, is a men's Twenty20 cricket league held annually in India. Founded by the BCCI in 2007, the league features ten state or city-based franchise teams. It is the most popular and richest cricket league in the world and its seasons usually take place between March and May. It has an exclusive window in the ICC Future Tours Programme, resulting in fewer international cricket tours occurring during the IPL seasons. It is also India's the most viewed sports competition followed by Pro Kabaddi League & Indian Super League as per BARC.",
            "longDescription": "The Indian Premier League, also known as IPL and Tata IPL for sponsorship reasons, is a men's Twenty20 cricket league held annually in India. Founded by the BCCI in 2007, the league features ten state or city-based franchise teams. It is the most popular and richest cricket league in the world and its seasons usually take place between March and May. It has an exclusive window in the ICC Future Tours Programme, resulting in fewer international cricket tours occurring during the IPL seasons. It is also India's the most viewed sports competition followed by Pro Kabaddi League & Indian Super League as per BARC.",
            "parentId": 5,
            "image": "https://www.crickclare.com/images/bcci.jpg",
            "keywords": [
                "BCCI",
                "ipl",
                "Indian cricket"
            ]
        },
        {
            "id": 7,
            "name": "Englend Cricket",
            "slug": "englend-cricket",
            "description": "The England men's cricket team represents England and Wales in international cricket. Since 1997, it has been governed by the England and Wales Cricket Board (ECB), having been previously governed by Marylebone Cricket Club (the MCC) since 1903. England, as a founding nation, is a Full Member of the International Cricket Council (ICC) with Test, One Day International (ODI) and Twenty20 International (T20I) status. Until the 1990s, Scottish and Irish players also played for England as those countries were not yet ICC members in their own right.",
            "longDescription": "The England men's cricket team represents England and Wales in international cricket. Since 1997, it has been governed by the England and Wales Cricket Board (ECB), having been previously governed by Marylebone Cricket Club (the MCC) since 1903. England, as a founding nation, is a Full Member of the International Cricket Council (ICC) with Test, One Day International (ODI) and Twenty20 International (T20I) status. Until the 1990s, Scottish and Irish players also played for England as those countries were not yet ICC members in their own right.",
            "parentId": 1,
            "image": "https://www.crickclare.com/images/australian-cricket.jpg",
            "keywords": [
                "Englend Cricket",
                "national team",
                "ECB",
                "ODI",
                "Champion Trophy 2025"
            ]
        },
        {
            "id": 8,
            "name": "Afghanistan Cricket",
            "slug": "afghanistan-cricket",
            "description": "The Afghanistan men's national cricket team represents Afghanistan in men's international cricket. It is a full Member of the International Cricket Council (ICC) with Test, One-Day International (ODI) and T20 International (T20I) status.",
            "longDescription": "The Afghanistan men's national cricket team represents Afghanistan in men's international cricket. It is a full Member of the International Cricket Council (ICC) with Test, One-Day International (ODI) and T20 International (T20I) status.",
            "parentId": 1,
            "image": "https://www.crickclare.com/images/afghanistan-cricket.jpg",
            "keywords": [
                "Afghanistan Cricket",
                "national team",
                "Test cricket",
                "ODI",
                "T20I",
                "Champion Trophy 2025",
                "ACB"
            ]
        },
        {
            "id": 9,
            "name": "New Zealand Cricket",
            "slug": "new-zealand-cricket",
            "description": "The New Zealand national cricket team represents New Zealand in men's international cricket. Nicknamed the Black Caps they played their first Test in 1930 against England in Christchurch, becoming the fifth country to play Test cricket. From 1930 New Zealand had to wait until 1956, more than 26 years, for its first Test victory, against the West Indies at Eden Park in Auckland. They played their first ODI in the 1972–73 season against Pakistan in Christchurch. New Zealand are the inaugural champions of WTC which they won in 2021 and they have also won ICC CT in 2000. They have played in the CWC final twice and the T20 WC final once.",
            "longDescription": "The New Zealand national cricket team represents New Zealand in men's international cricket. Nicknamed the Black Caps they played their first Test in 1930 against England in Christchurch, becoming the fifth country to play Test cricket. From 1930 New Zealand had to wait until 1956, more than 26 years, for its first Test victory, against the West Indies at Eden Park in Auckland. They played their first ODI in the 1972–73 season against Pakistan in Christchurch. New Zealand are the inaugural champions of WTC which they won in 2021 and they have also won ICC CT in 2000. They have played in the CWC final twice and the T20 WC final once.",
            "parentId": 1,
            "image": "https://www.crickclare.com/images/new-zealand-cricket.jpg",
            "keywords": [
                "New Zealand",
                "national team",
                "Test cricket",
                "ODI",
                "T20I",
                "Champion Trophy 2025",
                "NZCB"
            ]
        },
        {
            "id": 10,
            "name": "Pakistan Cricket",
            "slug": "pakistan-cricket",
            "description": "The Pakistan national cricket team has represented Pakistan in international cricket since 1952. It is controlled by the Pakistan Cricket Board (PCB), the governing body for cricket in Pakistan, which is a Full Member of the International Cricket Council (ICC). Pakistan compete in cricket tours and tournaments sanctioned by the PCB and other regional or international cricket bodies in Test, One Day International (ODI), and Twenty20 International (T20) formats. Pakistan are current ICC Champions Trophy holders.",
            "longDescription": "The Pakistan national cricket team has represented Pakistan in international cricket since 1952. It is controlled by the Pakistan Cricket Board (PCB), the governing body for cricket in Pakistan, which is a Full Member of the International Cricket Council (ICC). Pakistan compete in cricket tours and tournaments sanctioned by the PCB and other regional or international cricket bodies in Test, One Day International (ODI), and Twenty20 International (T20) formats. Pakistan are current ICC Champions Trophy holders.",
            "parentId": 1,
            "image": "https://www.crickclare.com/images/new-zealand-cricket.jpg",
            "keywords": [
                "Pakistan",
                "national team",
                "Test cricket",
                "ODI",
                "T20I",
                "Champion Trophy 2025",
                "PCB"
            ]
        }
    ]
}